name: "3dup_1fc"
layers {
  name: "data_55"
  type: IMAGE_DATA
  top: "data_55"
  top: "label_3dnorm"
  image_data_param {
    source: "/home/dragon123/3dnormal_joint_cnncode/imgfile_global.txt"
    mean_file: "/home/dragon123/3dnormal_joint_cnncode/models/global_model/3d_mean.binaryproto"
    batch_size: 10
    crop_size: 55
    mirror: false
    shuffle: false
    new_height: 55
    new_width: 55
  }
}
layers {
  name: "conv2_55"
  type: CONVOLUTION
  bottom: "data_55"
  top: "conv2_55"
  blobs_lr: 0.1
  blobs_lr: 0.2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    #pad: 1
    kernel_size: 5
    #group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layers {
  name: "relu2_55"
  type: RELU
  bottom: "conv2_55"
  top: "conv2_55"
}
layers {
  name: "pool2_55"
  type: POOLING
  bottom: "conv2_55"
  top: "pool2_55"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layers {
  name: "norm2_55"
  type: LRN
  bottom: "pool2_55"
  top: "norm2_55"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layers {
  name: "conv3_55"
  type: CONVOLUTION
  bottom: "norm2_55"
  top: "conv3_55"
  blobs_lr: 0.1
  blobs_lr: 0.2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu3_55"
  type: RELU
  bottom: "conv3_55"
  top: "conv3_55"
}



layers {
  name: "pool3_55"
  type: POOLING
  bottom: "conv3_55"
  top: "pool3_55"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layers {
  name: "norm3_55"
  type: LRN
  bottom: "pool3_55"
  top: "norm3_55"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}

layers {
  name: "conv4_55"
  type: CONVOLUTION
  bottom: "norm3_55"
  top: "conv4_55"
  blobs_lr: 0.1
  blobs_lr: 0.2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layers {
  name: "relu4_55"
  type: RELU
  bottom: "conv4_55"
  top: "conv4_55"
}
layers {
  name: "conv5_55"
  type: CONVOLUTION
  bottom: "conv4_55"
  top: "conv5_55"
  blobs_lr: 0.1
  blobs_lr: 0.2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layers {
  name: "relu5_55"
  type: RELU
  bottom: "conv5_55"
  top: "conv5_55"
}




layers {
  name: "fc8_coarse"
  type: INNER_PRODUCT
  bottom: "conv5_55"
  top: "fc8_coarse"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 8000
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}


layers {
  name: "fc8_layout"
  type: INNER_PRODUCT
  bottom: "conv5_55"
  top: "fc8_layout"
  blobs_lr: 50
  blobs_lr: 100
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 300
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}




layers {
  name: "reshape_global"
  type: RESHAPE
  bottom: "fc8_coarse"
  top: "reshape_global"
  reshape_param {
    new_channel: 20 
    new_height: 20
    new_width: 20
    new_patch_width: 20
    new_patch_height: 20
  }
}

layers {
  name: "prob_3dnorm"
  type: MULTI_SOFTMAX
  bottom: "reshape_global"
  top: "prob_3dnorm"
}

layers {
  name: "decode_global"
  type: DECODE
  bottom: "prob_3dnorm"
  top: "decode_global"
  decode_param {
    source_dict: "/home/dragon123/3dnormal_joint_cnncode/models/global_model/codebook_20.txt"
    source_triids: "/home/dragon123/3dnormal_joint_cnncode/models/global_model/triangles_20.txt"
    # usesoft: true
  }
}

layers {
  name: "resize_global"
  type: RESIZE
  bottom: "decode_global"
  top: "resize_global"
  resize_param {
    height: 195
    width: 260
  }
}


layers {
  name: "norm_global"
  type: NORM
  bottom: "resize_global"
  top: "norm_global"
}

layers {
  name: "prob_3dnorm_2"
  type: SOFTMAX
  bottom: "fc8_layout"
  top: "prob_3dnorm_2"
}


layers {
  top: "accuracy"
  name: "accuracy"
  type: ACCURACY
  bottom: "norm_global"
  bottom: "prob_3dnorm_2"
  bottom: "label_3dnorm"
}



